<?php

use Mydevelopersway\Com\Job4\Route;

?>

<h1>Добро пожаловать!</h1>
<p><strong>Задание 1 (технология PHP)</strong></p>
<p>Написать скрипт, который занимается созданием сокращенного варианта ФИО.<br>
Например, вводим: Иванов Иван Петрович, а в результате должны получить: Иванов И. П.
</p>
<p><a href="job1">Решениe</a></p>
<p><strong>Задание 2 (технология CSS)</strong></p>
<p>Необходимо реализовать следующее:</p>
<ol>
    <li>Поворот элемента на 90°</li>
    <li>Отражение по горизонтали</li>
    <li>Поворот на 360° при наведении</li>
    <li>Увеличение блока в 2 раза, при наведении</li>
</ol>
<p><a href="job2">Решениe</a></p>
<p><strong>Задание 3 (технология Javascript)</strong></p>
<p>Напишите функцию, принимающую массив произвольных слов и на выходе дающую двумерный массив анаграмм:</p>
<p>['стол', 'барокко', 'слот', 'кот', 'кошка', 'ток', 'коробка']<br>
// -><br>
[<br>
  ['стол', 'слот'],<br>
  ['кот', 'ток'],<br>
  ['барокко', 'коробка'],<br>
]<br>
</p>
<p><a href="job3">Решениe</a></p>
<p><strong>Задание 4 (Шифровочка)</strong></p>
<p>При помощи приведенного шифра восстановите весь кроссворд, (не забывайте про черные клетки). В финале задания составьте ключевое слово:</p>
<p><a href="job4">Решениe</a></p>
<!--<p><a href="job5">404</a></p>--!>
